NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/ZGM23/ZGM230SA27HNN.svd
        <register>
          <name>ANARAMP0</name>
          <description>No Description</description>
          <addressOffset>0x0E4</addressOffset>
          <access>read-write</access>
          <resetValue>0x08418C40</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>
          <fields>
            <field>
              <name>ANARAMPLUT0</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT1</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT2</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT3</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT4</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT5</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>25</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANARAMP1</name>
          <description>No Description</description>
          <addressOffset>0x0E8</addressOffset>
          <access>read-write</access>
          <resetValue>0x18A4A0C5</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>
          <fields>
            <field>
              <name>ANARAMPLUT6</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT7</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT8</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT9</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT10</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT11</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>25</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANARAMP2</name>
          <description>No Description</description>
          <addressOffset>0x0EC</addressOffset>
          <access>read-write</access>
          <resetValue>0x020ED60D</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>
          <fields>
            <field>
              <name>ANARAMPLUT12</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT13</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT14</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT15</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT16</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT17</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>25</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANARAMP3</name>
          <description>No Description</description>
          <addressOffset>0x0F0</addressOffset>
          <access>read-write</access>
          <resetValue>0x06210821</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>
          <fields>
            <field>
              <name>ANARAMPLUT18</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT19</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT20</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT21</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT22</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT23</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>25</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANARAMP4</name>
          <description>No Description</description>
          <addressOffset>0x0F4</addressOffset>
          <access>read-write</access>
          <resetValue>0x08420C63</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>
          <fields>
            <field>
              <name>ANARAMPLUT24</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT25</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT26</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT27</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT28</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT29</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>25</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANARAMP5</name>
          <description>No Description</description>
          <addressOffset>0x0F8</addressOffset>
          <access>read-write</access>
          <resetValue>0x0C6294A5</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>
          <fields>
            <field>
              <name>ANARAMPLUT30</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT31</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT32</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT33</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT34</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT35</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>25</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANARAMP6</name>
          <description>No Description</description>
          <addressOffset>0x0FC</addressOffset>
          <access>read-write</access>
          <resetValue>0x10739CE6</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>
          <fields>
            <field>
              <name>ANARAMPLUT36</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT37</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT38</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT39</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT40</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT41</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>25</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANARAMP7</name>
          <description>No Description</description>
          <addressOffset>0x100</addressOffset>
          <access>read-write</access>
          <resetValue>0x1494A508</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>
          <fields>
            <field>
              <name>ANARAMPLUT42</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT43</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT44</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT45</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT46</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT47</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>25</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANARAMP8</name>
          <description>No Description</description>
          <addressOffset>0x104</addressOffset>
          <access>read-write</access>
          <resetValue>0x18C5AD4A</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>
          <fields>
            <field>
              <name>ANARAMPLUT48</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT49</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT50</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT51</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT52</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT53</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>25</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANARAMP9</name>
          <description>No Description</description>
          <addressOffset>0x108</addressOffset>
          <access>read-write</access>
          <resetValue>0x2307B9AD</resetValue>
          <resetMask>0x3FFFFFFF</resetMask>
          <fields>
            <field>
              <name>ANARAMPLUT54</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT55</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT56</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT57</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT58</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>20</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT59</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>25</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ANARAMP10</name>
          <description>No Description</description>
          <addressOffset>0x10C</addressOffset>
          <access>read-write</access>
          <resetValue>0x000FF2F3</resetValue>
          <resetMask>0x000FFFFF</resetMask>
          <fields>
            <field>
              <name>ANARAMPLUT60</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT61</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>5</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT62</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>10</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ANARAMPLUT63</name>
              <description>Analog Ramp LUT</description>
              <bitOffset>15</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCOMP</name>
          <description>No Description</description>
          <addressOffset>0x110</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000030</resetValue>
          <resetMask>0x001FFFFF</resetMask>
          <fields>
            <field>
              <name>DCESTIEN</name>
              <description>DC Offset Estimation Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCCOMPEN</name>
              <description>DC Offset Compensation Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCRSTEN</name>
              <description>DC Compensation Filter Reset Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCCOMPFREEZE</name>
              <description>DC Offset Compensation Filter Freeze</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCCOMPGEAR</name>
              <description>DC Offset Compensation Filter Gear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCLIMIT</name>
              <description>DC offset limit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FULLSCALE</name>
                  <description>1000 mV</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FULLSCALEBY4</name>
                  <description>250 mV</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FULLSCALEBY8</name>
                  <description>125 mV</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FULLSCALEBY16</name>
                  <description>62 mV</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCGAINGEAREN</name>
              <description>DC Offset Gain Change Filter Gear Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCGAINGEAR</name>
              <description>DC Offset Gain Change Filter Gear</description>
              <bitOffset>10</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCGAINGEARSMPS</name>
              <description>DC Offset Gain Change Samples</description>
              <bitOffset>13</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
