NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/ZGM23/ZGM230SA27HNN.svd
        <register>
          <name>PLAYBACKCTRL</name>
          <description>No Description</description>
          <addressOffset>0x080</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000014</resetValue>
          <resetMask>0x0000001F</resetMask>
          <fields>
            <field>
              <name>MODE</name>
              <description>Playback Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SINGLE</name>
                  <description>Playback starts at BUF0_BASE and stops at BUF1_BASE + BUF1_LIMITOFFSET</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOOP</name>
                  <description>Playback starts at BUF0_BASE and loops/wraps continuously until CTRL.MODE != PLAYBACK (this can be supported in single or double-buffer modes)</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COND</name>
              <description>Playback Condition</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>START_TRIGGER</name>
                  <description>Playback event occurs at every start-trigger event</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIMED</name>
                  <description>Playback event occurs based on rate defined in PLAYBACL_RATE_CTRL</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DATAWIDTH</name>
              <description>Playback Data Width</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BIT1</name>
                  <description>1 bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIT2</name>
                  <description>2 bits</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIT4</name>
                  <description>4 bits</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIT8</name>
                  <description>8 bits</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIT16</name>
                  <description>16 bits</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIT32</name>
                  <description>32 bits</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PLAYBACKRATECTRL</name>
          <description>No Description</description>
          <addressOffset>0x084</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>RATE</name>
              <description>Playback Rate</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTCNTRCTRL</name>
          <description>No Description</description>
          <addressOffset>0x088</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>
          <fields>
            <field>
              <name>STARTMODE</name>
              <description>Start Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MANUAL</name>
                  <description>Counting starts as soon as ENABLE=1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>START_TRIGGER</name>
                  <description>Counting starts when the start-trigger event occurs</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STOPMODE</name>
              <description>Stop Mode</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MANUAL</name>
                  <description>When writing a 1, stops the counter advancing</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP_TRIGGER</name>
                  <description>When stop trigger is active, stops the counter advancing</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMPARE</name>
                  <description>When the count reaches the value programmed in EVENTCNTRCOMPARE, stops the counter advancing</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COUNTMODE</name>
              <description>Count Mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYS</name>
                  <description>Increment on every clock cycle</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>START_TRIGGER</name>
                  <description>Increment on every start-trigger event</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STOP_TRIGGER</name>
                  <description>Increment on every stop-trigger event</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ALL_TRIGGER</name>
                  <description>Increment on either every start- or stop-trigger event</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTCNTRCOMPARE</name>
          <description>No Description</description>
          <addressOffset>0x08C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>COMPARE</name>
              <description>Compare Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EVENTCNTRSTATUS</name>
          <description>No Description</description>
          <addressOffset>0x090</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>STATUS</name>
              <description>Event Count Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
